{
    "task1_redshift": "Q: Redshift is a measure of how much the wavelength of light from a galaxy has been stretched due to the expansion of the universe. It provides crucial information on the galaxy's velocity and distance and can be analyzed through multiple perspectives. Specifically, the <|image|> utilizes celestial image data to obtain observational information such as morphology and luminosity, providing an initial estimate of distance.By integrating the information from these tokens, we derive the redshift value of the celestial object. <|reserved_special_token_1|> [ANS]",
    
    "task2_log_mstar":"Q: Stellar mass refers to the total mass of all the stars in a galaxy. It is a critical parameter for understanding galaxy formation and evolution and can be analyzed through multiple perspectives. Specifically, the <|image|> utilizes celestial image data to assess morphology and luminosity, which helps in the initial estimation of stellar mass. By integrating information from these tokens, please tell me the Stellar Mass. <|reserved_special_token_1|> [ANS]",

    "task2_z_mw":"Q: Mass-weighted stellar metallicity measures the abundance of elements heavier than hydrogen and helium in a galaxy's stars, weighted by their mass. This aids in understanding the galaxy's chemical evolution and can be analyzed through multiple perspectives. Specifically, the <|image|> helps observe the color and brightness variations of celestial objects, providing initial metallicity estimates. By integrating information from these tokens, please tell me the Mass-Weighted Stellar Metallicity. <|reserved_special_token_1|> [ANS]",
    
    "task2_tage_mw": "Q: Mass-weighted galaxy age refers to the average age of stars within a galaxy, weighted by their mass, providing insights into the galaxy's formation history. This can be analyzed through multiple perspectives. Specifically, the <|image|> assesses morphology and color via celestial images to estimate the age distribution of stellar populations in the galaxy. By integrating information from these tokens, please tell me its Mass-Weighted Galaxy Age (Gyr). <|reserved_special_token_1|> [ANS]",

    "task2_sSFR": "Q: The specific star-formation rate (sSFR) is the rate of star formation per unit stellar mass in a galaxy, indicating how actively the galaxy is forming stars relative to its existing stellar mass. It can be analyzed through multiple perspectives. Specifically, the <|image|> helps analyze star-forming regions, morphology, and density variations via celestial images for initial estimation of the star-formation rate. By integrating information from these tokens, please tell me its Specific Star-Formation Rate. <|reserved_special_token_1|> [ANS]"
}